/*
 * 	main.c
 *
 *  Created on: 22.07.2022
 *  Autho     : Беляев А.А.
 *
 *
 *	Описание  : MCUv7
 *
 *	Последнее редактирование: 22.09.2022
 *
 */
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
Button_t PwrButton;

void DBG_SendDebugInfo(void);

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
static void STM32_Init(void){

 	STM32_Clock_Init();
 	STM32_GPIO_Init();
 	DELAY_Init();

 	STM32_GPIO_InitForOutputPushPull(LedPC13_GPIO, LedPC13_PIN);
}
//**********************************************************
static void SettingInterruptPriorities(void){

	//Приоритеты прерываний.
	//Таймер управления мотором - самый высокий приоритет = 1.
//	NVIC_SetPriority(TIM1_UP_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 1, 0));
//	//Прерывания I2C для работы протакола - приоритет = 2
//	NVIC_SetPriority(I2C2_EV_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 2, 0));
//	NVIC_SetPriority(I2C2_ER_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 2, 0));
	//Системный таймер, прерывание каждую 1мс - самый низкий приоритет = 3
	NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 3, 0));
	//Разрешаем прерывания.
//	NVIC_EnableIRQ(TIM1_UP_IRQn);
//	NVIC_EnableIRQ(I2C2_EV_IRQn);
//	NVIC_EnableIRQ(I2C2_ER_IRQn);
	NVIC_EnableIRQ(SysTick_IRQn);
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************




//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
int main(void){

	//--------------------------
	STM32_Init();	 //Инициализация STM32.
 	//GPIO_MCU_Init(); //Инициализация портов MCU.
	//--------------------------
	//Инициализация кнопки питания и АЦП для измерения напряжения АКБ.
	//POWER_Init();

	//Включение питания платы. Смотрим что там с напряжением АКБ.
	//POWER_TurnOnAndSupplyVoltageCheck();

	//Включение питания периферии.
	//PWR_BTN_LED_High();
	//FAN_EN_High();
	//LIDAR_EN_High();
	//LAMP_PWM_High();
	DELAY_mS(100); //Задержка для стабилизации напряжения патания.
	//--------------------------
	//Инициализация дисплея
	st7735_init(ST77XX_BLACK);

	//--------------------------
	//Ини-я диспетчера.
	RTOS_Init();
	//RTOS_SetTask(Task_POWER_Check,   1000, 100);//Опрос кнопки питания и проверка напряжения питания каждые 100мс.
	//RTOS_SetTask(Task_TEMPERATURE_Read, 0, 500);//Измерение температуры каждую 1сек.
	//RTOS_SetTask(Task_CheckRotate,      0, 50); //Проверка вращения. Не отлажена!!!

	//--------------------------
	SysTick_Init();
	SettingInterruptPriorities();//Приоритеты прерываний
	__enable_irq();				 //Глобальное разрешение прерываний

	//**************************************************************
	while(1)
	{
		//RTOS_DispatchLoop();
		//__WFI(); //Sleep

//		if(Blink(INTERVAL_50_mS)) LedPC13On();
//		else					  LedPC13Off();

//		if(Blink_WithVariablePeriod(RTOS_GetTickCount(), 1000, 5)) 	LedPC13On();
//		else 														LedPC13Off();

		LedPC13Toggel();
		DELAY_mS(1000);

//		st7735_fill(5, 80, 5, 80, ST77XX_BLACK);
//		st7735_fill(5, 80, 5, 80, ST77XX_ORANGE);
//		DELAY_mS(500);
//
//		st7735_fill(5, 80, 5, 80, ST77XX_BLACK);
//		st7735_fill(5, 60, 5, 60, ST77XX_ORANGE);
//		DELAY_mS(500);


//		st7735_clear(ST77XX_BLACK);
//		DELAY_mS(1000);
//		//println("begin");
//		st7735_rectangle(0,50,5,50,ST77XX_RED);
//		st7735_rectangle(30,50,55,50,ST77XX_GREEN);
//		st7735_rectangle(70,50,105,50,ST77XX_BLUE);
//		st7735_point(30,130,ST77XX_WHITE);
//		st7735_line_horizont(5,154,118,2,ST7735_WHITE);
//		st7735_line_horizont(5,5,118,2,ST7735_WHITE);
//		st7735_line_vertical(5,5,150,1,ST7735_WHITE);
//		st7735_line_vertical(123,5,150,1,ST7735_WHITE);
//		//println("end");
//		//gpio_reset(GPIOC,LED);
//		DELAY_mS(3000);

//		st7735_clear(ST77XX_BLACK);
//		st7735_line_horizont(5,154,118,2,ST7735_WHITE);
//		st7735_line_horizont(5,5,118,2,ST7735_WHITE);
//		st7735_line_vertical(5,5,150,1,ST7735_WHITE);
//		st7735_line_vertical(123,5,150,1,ST7735_WHITE);
//
//		DELAY_mS(2000);

		//st7735_clear(ST77XX_BLACK);
		//st7735_WriteChar(1, 1, 'A', Font_11x18, ST7735_YELLOW, ST7735_RED);

		//-------------------------------
		//Тест : Вывод текстовых строк и значений счетчиков - Работает!!!
		static uint32_t count = 0;
		count++;

		//Строка 1.
		char str1[] = "Count1 = ";
		uint16_t pos1_x = (sizeof(str1)-1) * Font_7x10.width;

		st7735_WriteString(0, 0, str1, Font_7x10, ST77XX_ORANGE, ST77XX_BLACK);
		st7735_BinToDec(pos1_x, 0, count, 4, Font_7x10, ST77XX_ORANGE, ST77XX_BLACK);

		//Строка 2.
		char str2[] = "Count2=";
		uint16_t pos2_x = (sizeof(str2)-1) * Font_11x18.width;
		uint16_t pos2_y = Font_7x10.height;

		st7735_WriteString(0, pos2_y, str2, Font_11x18, ST77XX_GREEN, ST77XX_RED);
		st7735_BinToDec(pos2_x, pos2_y, count+1, 4, Font_11x18, ST77XX_GREEN, ST77XX_RED);

		//Вертикальная зеленая линия
		st7735_line_vertical(10, Font_11x18.height+pos2_y+3, 100, 2, ST77XX_GREEN);
		//-------------------------------
		//Тест : Вывод картинки - Не работает.
		//st7735_DrawImage(0, 0, 128, 128, Font_11x18.data);
	}
	//**************************************************************
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
void SysTick_IT_Handler(void){

	Blink_Loop();
	STM32_GPIO_CheckLoop();
	RTOS_TimerServiceLoop();//Служба таймеров.
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************











