/*
 * 	main.c
 *
 *  Created on: 22.07.2022
 *  Autho     : Беляев А.А.
 *
 *
 *	Описание  : MCUv7
 *
 *	Последнее редактирование: 22.09.2022
 *
 */
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
Button_t PwrButton;

void DBG_SendDebugInfo(void);

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
static void STM32_Init(void){

 	STM32_Clock_Init();
 	STM32_GPIO_Init();
 	DELAY_Init();

 	STM32_GPIO_InitForOutputPushPull(LedPC13_GPIO, LedPC13_PIN);
}
//**********************************************************
static void SettingInterruptPriorities(void){

	//Приоритеты прерываний.
	//Таймер управления мотором - самый высокий приоритет = 1.
//	NVIC_SetPriority(TIM1_UP_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 1, 0));
//	//Прерывания I2C для работы протакола - приоритет = 2
//	NVIC_SetPriority(I2C2_EV_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 2, 0));
//	NVIC_SetPriority(I2C2_ER_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 2, 0));
	//Системный таймер, прерывание каждую 1мс - самый низкий приоритет = 3
	NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 3, 0));
	//Разрешаем прерывания.
//	NVIC_EnableIRQ(TIM1_UP_IRQn);
//	NVIC_EnableIRQ(I2C2_EV_IRQn);
//	NVIC_EnableIRQ(I2C2_ER_IRQn);
	NVIC_EnableIRQ(SysTick_IRQn);
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//стрелочный индикатор
#define ANALOG_SCALE_ANGLE_MIN	50
#define ANALOG_SCALE_ANGLE_MAX	132

/*
 * Параметры:
 * angle :угол на который нужно повернуть стрелку (слева направо)
 *		  мин. уол  - 50  градусов.
 *		  макс.угол - 132 градуса.
 */
void Lcd_AnalogScale(uint8_t angle){

	const uint8_t markRadius = 64;// Радиус шкалы.
	int16_t x0 = 64;		  	  // Х-координата центра шкалы
	int16_t y0 = 150; 	  		  // Y-координата центра шкалы.
	float cos;
	float sin;
	//-------------------
	//Рисуем риски-метки шкалы
	for(float i = 0; i < M_PI_2; i += M_PI_2/8)
	{
		cos = cosf(i + M_PI_4);
		sin = sinf(i + M_PI_4);
		st7735_Line(x0 +  markRadius    * cos,	//x1
				 	y0 +  markRadius    * sin,	//y1
					x0 + (markRadius-6) * cos, //x2
					y0 + (markRadius-6) * sin, //y2
					ST77XX_GREEN);
	}
	//Стрелка.
	angle = (180 - angle); 	     	   //Это нужно чтобы стрелка двигалась слева направо.
	float rad = angle * (M_PI / 180.0);//перевод углов в радианы
	cos = cosf(rad);
	sin = sinf(rad);
	//x0 += 1; //небольшое смещение по Х что бы стрелка точно поподала в среднюю риску.
	y0 += 5; //небольшое смещение по Y что бы стрелка поподала в риски.
//	st7735_Line(x0 + markRadius * cos,
//			 	y0 + markRadius * sin,
//				x0 + 1 * cos,
//				y0 + 1 * sin,
//				ST77XX_GREEN);

	st7735_Line(x0,
				y0,
				x0 - markRadius * cos,
				y0 - markRadius * sin,
				ST77XX_GREEN);

}



//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
int main(void){

	//--------------------------
	STM32_Init();	 //Инициализация STM32.
 	//GPIO_MCU_Init(); //Инициализация портов MCU.
	//--------------------------
	//Инициализация кнопки питания и АЦП для измерения напряжения АКБ.
	//POWER_Init();

	//Включение питания платы. Смотрим что там с напряжением АКБ.
	//POWER_TurnOnAndSupplyVoltageCheck();

	//Включение питания периферии.
	//PWR_BTN_LED_High();
	//FAN_EN_High();
	//LIDAR_EN_High();
	//LAMP_PWM_High();
	DELAY_mS(100); //Задержка для стабилизации напряжения патания.
	//--------------------------
	//Инициализация дисплея
	st7735_Init(ST77XX_BLACK);

	//--------------------------
	//Ини-я диспетчера.
	RTOS_Init();
	//RTOS_SetTask(Task_POWER_Check,   1000, 100);//Опрос кнопки питания и проверка напряжения питания каждые 100мс.
	//RTOS_SetTask(Task_TEMPERATURE_Read, 0, 500);//Измерение температуры каждую 1сек.
	//RTOS_SetTask(Task_CheckRotate,      0, 50); //Проверка вращения. Не отлажена!!!

	//--------------------------
	SysTick_Init();
	SettingInterruptPriorities();//Приоритеты прерываний
	__enable_irq();				 //Глобальное разрешение прерываний

	//**************************************************************
	while(1)
	{
		//RTOS_DispatchLoop();
		//__WFI(); //Sleep

//		if(Blink(INTERVAL_50_mS)) LedPC13On();
//		else					  LedPC13Off();

//		if(Blink_WithVariablePeriod(RTOS_GetTickCount(), 1000, 5)) 	LedPC13On();
//		else 														LedPC13Off();

		LedPC13Toggel();
		DELAY_mS(500);
		//-------------------------------

		//Очищаем дисплей.
		st7735_clear(ST77XX_BLACK);

		//-------------------------------
		//Тест : Вывод текстовых строк и значений счетчиков - Работает!!!

		static uint32_t count = 0;
		count++;

		//Строка 1.
		char str1[] = "Count1=";
		uint16_t pos1_x = (sizeof(str1)-1) * Font_7x10.width;

		st7735_WriteString(0, 0, str1, Font_7x10, ST77XX_ORANGE, ST77XX_BLACK);
		st7735_BinToDec(pos1_x, 0, count, 4, Font_7x10, ST77XX_ORANGE, ST77XX_BLACK);

		//Строка 2.
		char str2[] = "Count2=";
		uint16_t pos2_x = (sizeof(str2)-1) * Font_9x16.width;
		uint16_t pos2_y = Font_7x10.height;

		st7735_WriteString(0, pos2_y, str2, Font_9x16, ST77XX_GREEN, ST77XX_BLACK);
		st7735_BinToDec(pos2_x, pos2_y, count+1, 4, Font_9x16, ST77XX_GREEN, ST77XX_BLACK);

		st7735_WriteString(0, 26, "Vcc=123456", Font_11x18, ST77XX_BLUE, ST77XX_BLACK);

		st7735_WriteString(0, 44, "Vcc=123456", Font_7x10, ST77XX_GREEN, ST77XX_BLACK);

		st7735_WriteString(0, 55, "Vcc=123456", Font_16x26, ST77XX_GREEN, ST77XX_BLACK);

		st7735_point(64, 130, ST77XX_WHITE);


		//Вертикальная зеленая линия
		//st7735_line_vertical(10, Font_11x18.height+pos2_y+3, 100, 2, ST77XX_GREEN);


		//-------------------------------
		//Тест - рисуем окружности.
		static uint8_t radius = 5;

		radius += 2;
		if(radius >= 28) radius = 5;

		st7735_Circle(64, 130, radius, ST77XX_WHITE);
		//-------------------------------
		//Тест : рисуем наклонную линию

		st7735_Line(1  , 160, 128, 1, ST77XX_WHITE);
		st7735_Line(128, 160,   1, 1, ST77XX_WHITE);

		//-------------------------------
		//Тест : рисуем шкалу и стрелку
		static uint8_t angle = 0;

		angle += 5;
		if(angle >= 180) angle = 0;

		Lcd_AnalogScale(angle);

		//-------------------------------
		//Тест : Вывод картинки - Не работает.
		#include "testimg.h"

		//st7735_DrawImage(0, 0, 128, 128, test_img_128x128);
	}
	//**************************************************************
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
void SysTick_IT_Handler(void){

	Blink_Loop();
	STM32_GPIO_CheckLoop();
	RTOS_TimerServiceLoop();//Служба таймеров.
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************











