/*
 * main.c
 *
 *  Created on: Dec 18, 2020
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************
#include "main.h"



//*******************************************************************************************
//*******************************************************************************************
//Переменные
//static uint32_t PWRval      = 0;
static uint16_t sinTableIndex = 0;

//*******************************************************************************************
//*******************************************************************************************
void IncrementOnEachPass(uint32_t *var, uint16_t event){

		   uint16_t riseReg  = 0;
	static uint16_t oldState = 0;
	//--------------------------
	riseReg  = (oldState ^ event) & event;
	oldState = event;
	if(riseReg) (*var)++;
}
//************************************************************
void DecrementOnEachPass(uint32_t *var, uint16_t event){

		   uint16_t riseReg  = 0;
	static uint16_t oldState = 0;
	//--------------------------
	riseReg  = (oldState ^ event) & event;
	oldState = event;
	if(riseReg) (*var)--;
}
//************************************************************
void Led_Blink(void){

	if(Blink(INTERVAL_50_mS)) Led_PC13_On();
	else					  Led_PC13_Off();
}
//************************************************************
uint8_t tic(uint16_t event){

	  	   uint16_t riseReg  = 0;
	static uint16_t oldState = 0;
	//--------------------------
	riseReg  = (oldState ^ event) & event;
	oldState = event;
	if(riseReg) return 1;
	else 		return 0;
}
//*******************************************************************************************
//*******************************************************************************************
#define EN1	1
#define EN2	2
#define EN3	3

#define MOTOR_DELAY 4
#define EN_ON	    860 //820 - 860 //в этом диапазоне ШИМ мотор работает тихо
#define EN_OFF      0   //10
//************************************************************
// Sin table
#define PMSM_SINTABLESIZE	192

#pragma pack(push, 1)//размер выравнивания в 1 байт
static const uint8_t PMSM_SINTABLE [PMSM_SINTABLESIZE][3] =
{
//  фаза1 | фаза2  | фаза3
	{0,       0,      221}, // 0
	{8,       0,      225}, // 1
	{17,      0,      229}, // 3
	{25,      0,      232}, // 4
	{33,      0,      236}, // 5
	{42,      0,      239}, // 6
	{50,      0,      241}, // 7
	{58,      0,      244}, // 8
	{66,      0,      246}, // 9
	{74,      0,      248}, // 10
	{82,      0,      250}, // 11
	{90,      0,      252}, // 12
	{98,      0,      253}, // 13
	{105,     0,      254}, // 14
	{113,     0,      254}, // 15
	{120,     0,      255}, // 16
	{128,     0,      255}, // 17
	{135,     0,      255}, // 18
	{142,     0,      254}, // 19
	{149,     0,      254}, // 20
	{155,     0,      253}, // 21
	{162,     0,      252}, // 22
	{168,     0,      250}, // 23
	{174,     0,      248}, // 24
	{180,     0,      246}, // 25
	{186,     0,      244}, // 26
	{192,     0,      241}, // 27
	{197,     0,      239}, // 28
	{202,     0,      236}, // 29
	{207,     0,      232}, // 30
	{212,     0,      229}, // 31
	{217,     0,      225}, // 32
	{221,     0,      221}, // 33
	{225,     0,      217}, // 34
	{229,     0,      212}, // 35
	{232,     0,      207}, // 36
	{236,     0,      202}, // 37
	{239,     0,      197}, // 38
	{241,     0,      192}, // 39
	{244,     0,      186}, // 40
	{246,     0,      180}, // 41
	{248,     0,      174}, // 42
	{250,     0,      168}, // 43
	{252,     0,      162}, // 44
	{253,     0,      155}, // 45
	{254,     0,      149}, // 46
	{254,     0,      142}, // 47
	{255,     0,      135}, // 48
	{255,     0,      127}, // 49
	{255,     0,      120}, // 50
	{254,     0,      113}, // 51
	{254,     0,      105}, // 52
	{253,     0,      98},  // 53
	{252,     0,      90},  // 54
	{250,     0,      82},  // 55
	{248,     0,      74},  // 56
	{246,     0,      66},  // 57
	{244,     0,      58},  // 58
	{241,     0,      50},  // 59
	{239,     0,      42},  // 60
	{236,     0,      33},  // 61
	{232,     0,      25},  // 62
	{229,     0,      17},  // 63
	{225,     0,      8},   // 64
	{221,     0,      0},   // 65
	{225,     8,      0},   // 66
	{229,     17,     0},   // 67
	{232,     25,     0},   // 68
	{236,     33,     0},   // 69
	{239,     42,     0},   // 70
	{241,     50,     0},   // 71
	{244,     58,     0},   // 72
	{246,     66,     0},   // 73
	{248,     74,     0},   // 74
	{250,     82,     0},   // 75
	{252,     90,     0},   // 76
	{253,     98,     0},   // 77
	{254,     105,    0},   // 78
	{254,     113,    0},   // 79
	{255,     120,    0},   // 80
	{255,     127,    0},   // 81
	{255,     135,    0},   // 82
	{254,     142,    0},   // 83
	{254,     149,    0},   // 84
	{253,     155,    0},   // 85
	{252,     162,    0},   // 86
	{250,     168,    0},   // 87
	{248,     174,    0},   // 88
	{246,     180,    0},   // 89
	{244,     186,    0},   // 90
	{241,     192,    0},   // 91
	{239,     197,    0},   // 92
	{236,     202,    0},   // 93
	{232,     207,    0},   // 94
	{229,     212,    0},   // 95
	{225,     217,    0},   // 96
	{221,     221,    0},   // 97
	{217,     225,    0},   // 98
	{212,     229,    0},   // 99
	{207,     232,    0},   // 100
	{202,     236,    0},   // 101
	{197,     239,    0},   // 102
	{192,     241,    0},   // 103
	{186,     244,    0},   // 104
	{180,     246,    0},   // 105
	{174,     248,    0},   // 106
	{168,     250,    0},   // 107
	{162,     252,    0},   // 108
	{155,     253,    0},   // 109
	{149,     254,    0},   // 110
	{142,     254,    0},   // 111
	{135,     255,    0},   // 112
	{128,     255,    0},   // 113
	{120,     255,    0},   // 114
	{113,     254,    0},   // 115
	{105,     254,    0},   // 116
	{98,      253,    0},   // 117
	{90,      252,    0},   // 118
	{82,      250,    0},   // 119
	{74,      248,    0},   // 120
	{66,      246,    0},   // 121
	{58,      244,    0},   // 122
	{50,      241,    0},   // 123
	{42,      239,    0},   // 124
	{33,      236,    0},   // 125
	{25,      232,    0},   // 126
	{17,      229,    0},   // 127
	{8,       225,    0},   // 128
	{0,       221,    0},   // 129
	{0,       225,    8},   // 130
	{0,       229,    17},  // 131
	{0,       232,    25},  // 132
	{0,       236,    33},  // 133
	{0,       239,    42},  // 134
	{0,       241,    50},  // 135
	{0,       244,    58},  // 136
	{0,       246,    66},  // 137
	{0,       248,    74},  // 138
	{0,       250,    82},  // 139
	{0,       252,    90},  // 140
	{0,       253,    98},  // 141
	{0,       254,    105}, // 142
	{0,       254,    113}, // 143
	{0,       255,    120}, // 144
	{0,       255,    128}, // 145
	{0,       255,    135}, // 146
	{0,       254,    142}, // 147
	{0,       254,    149}, // 148
	{0,       253,    155}, // 149
	{0,       252,    162}, // 150
	{0,       250,    168}, // 151
	{0,       248,    174}, // 152
	{0,       246,    180}, // 153
	{0,       244,    186}, // 154
	{0,       241,    192}, // 155
	{0,       239,    197}, // 156
	{0,       236,    202}, // 157
	{0,       232,    207}, // 158
	{0,       229,    212}, // 159
	{0,       225,    217}, // 160
	{0,       221,    221}, // 161
	{0,       217,    225}, // 162
	{0,       212,    229}, // 163
	{0,       207,    232}, // 164
	{0,       202,    236}, // 165
	{0,       197,    239}, // 166
	{0,       192,    241}, // 167
	{0,       186,    244}, // 168
	{0,       180,    246}, // 169
	{0,       174,    248}, // 170
	{0,       168,    250}, // 171
	{0,       162,    252}, // 172
	{0,       155,    253}, // 173
	{0,       149,    254}, // 174
	{0,       142,    254}, // 175
	{0,       135,    255}, // 176
	{0,       128,    255}, // 177
	{0,       120,    255}, // 178
	{0,       113,    254}, // 179
	{0,       105,    254}, // 180
	{0,       98,     253}, // 181
	{0,       90,     252}, // 182
	{0,       82,     250}, // 183
	{0,       74,     248}, // 184
	{0,       66,     246}, // 185
	{0,       58,     244}, // 186
	{0,       50,     241}, // 187
	{0,       42,     239}, // 188
	{0,       33,     236}, // 189
	{0,       25,     232}, // 190
	{0,       17,     229}, // 191
	{0,       8,      225}  // 192
};
#pragma pack(pop)//вернули предыдущую настройку.
//************************************************************
//************************************************************
//Комутация обмоток двигателя ногодрыгом.
void BLDC_Commutation(void){

	//Фаза 1.
	MOTOR_EN1_On();
	MOTOR_IN1_On();

	MOTOR_EN2_On();
	MOTOR_IN2_Off();

	MOTOR_EN3_Off();

	msDelay(MOTOR_DELAY);
	//Фаза 2.
	MOTOR_EN2_Off();

	MOTOR_EN3_On();
	MOTOR_IN3_Off();

	msDelay(MOTOR_DELAY);
	//Фаза 3.
	MOTOR_EN1_Off();

	MOTOR_EN2_On();
	MOTOR_IN2_On();

	msDelay(MOTOR_DELAY);
	//Фаза 4.
	MOTOR_EN1_On();
	MOTOR_IN1_Off();

	MOTOR_EN3_Off();

	msDelay(MOTOR_DELAY);
	//Фаза 5.
	MOTOR_EN2_Off();

	MOTOR_EN3_On();
	MOTOR_IN3_On();

	msDelay(MOTOR_DELAY);
	//Фаза 6.
	MOTOR_EN1_Off();

	MOTOR_EN2_On();
	MOTOR_IN2_Off();

	msDelay(MOTOR_DELAY);
}
//************************************************************
void PWM_SetVal(uint8_t output, uint32_t pwmVal){

	if(output == EN1) TIM3->CCR1 = pwmVal;
	if(output == EN2) TIM3->CCR2 = pwmVal;
	if(output == EN3) TIM3->CCR3 = pwmVal;
}
//************************************************************
// Set PWM (same for all phases)
void PMSM_SetPWM(uint16_t PWM){

	TIM3->CCR1 = PWM;
	TIM3->CCR2 = PWM;
	TIM3->CCR3 = PWM;
}
//************************************************************
// Set PWM
void PMSM_SetPWM_UVW(uint16_t PWM1, uint16_t PWM2, uint16_t PWM3){

	TIM3->CCR1 = PWM1;
	TIM3->CCR2 = PWM2;
	TIM3->CCR3 = PWM3;
}
//************************************************************
//В этой реализации управления ШИМ подается на линии EN.
//На каждую линию EN свой согнал ШИМ.
void BLDC_PWMCommutation(void){

	static uint8_t phaseCounter = 0;
	//--------------------------
	phaseCounter++;
	switch(phaseCounter-1){
		//--------------
		case(0):
		//Фаза 1.
		MOTOR_IN1_On();
		PWM_SetVal(EN1, EN_ON);

		MOTOR_IN2_Off();
		PWM_SetVal(EN2, EN_ON);

		PWM_SetVal(EN3, EN_OFF);
		break;
		//--------------
		case(1):
		//Фаза 2.
		PWM_SetVal(EN2, EN_OFF);

		MOTOR_IN3_Off();
		PWM_SetVal(EN3, EN_ON);
		break;
		//--------------
		case(2):
		//Фаза 3.
		PWM_SetVal(EN1, EN_OFF);

		MOTOR_IN2_On();
		PWM_SetVal(EN2, EN_ON);
		break;
		//--------------
		case(3):
		//Фаза 4.
		MOTOR_IN1_Off();
		PWM_SetVal(EN1, EN_ON);

		PWM_SetVal(EN3, EN_OFF);
		break;
		//--------------
		case(4):
		//Фаза 5.
		PWM_SetVal(EN2, EN_OFF);

		MOTOR_IN3_On();
		PWM_SetVal(EN3, EN_ON);
		break;
		//--------------
		case(5):
		//Фаза 6.
		PWM_SetVal(EN1, EN_OFF);

		MOTOR_IN2_Off();
		PWM_SetVal(EN2, EN_ON);

		phaseCounter = 0;
		break;
		//--------------
		default:
		break;
		//--------------
	}


}
//************************************************************
void BLDC_PWMCommutation_rev2(void){

	static uint8_t phaseCounter = 0;
	//--------------------------
	phaseCounter++;
	switch(phaseCounter-1){
		//--------------
		case(0):
		//Фаза 1.

		break;
		//--------------
		case(1):
		//Фаза 2.

		break;
		//--------------
		case(2):
		//Фаза 3.

		break;
		//--------------
		case(3):
		//Фаза 4.

		break;
		//--------------
		case(4):
		//Фаза 5.

		break;
		//--------------
		case(5):
		//Фаза 6.


		phaseCounter = 0;
		break;
		//--------------
		default:
		break;
		//--------------
	}
	//--------------------------
}
//*******************************************************************************************
//*******************************************************************************************
//This text copied from site Блог им. Catethysis https://catethysis.ru
//Read more: STM32: генератор синусоидального сигнала на TIM и DMA https://catethysis.ru/osnovnaya/stm32-tim-dma-pwm-sin

#define PI  		 3.14159265359
#define _2PI  		 6.28318530718
#define PI_2  		 1.57079632679
#define DEGREES_120	 2.0944
#define DEGREES_240	 4.18879

#define CPU_Freq 72000000 // частота ядра микроконтроллера
#define PWM_Freq 20000    // частота модуляции
#define MOD_Freq 20       // частота переменного тока



#define PWM_MAX_VALUE	(CPU_Freq/PWM_Freq) //
#define STEPS_NUM		(PWM_Freq/MOD_Freq/2) //



//************************************************************
//************************************************************

static uint16_t sin_arr[STEPS_NUM][3];

//************************************************************
//************************************************************
void FillSinTable(void){

	float arg = (PI / STEPS_NUM);
	//--------------------------
	for(int i = 0; i < STEPS_NUM; i++)
		{
			//sin_arr[i] = (uint16_t)( fabs(PRECISION * sin(i * arg)) );
			sin_arr[i][0] = (uint16_t)(PWM_MAX_VALUE * sinf(i * arg));
//			sin_arr[i][1] = (uint16_t)(PWM_MAX_VALUE * sinf((i + STEPS_NUM/3) * arg));
//			sin_arr[i][2] = (uint16_t)(PWM_MAX_VALUE * sinf((i + STEPS_NUM/6) * arg));
		}
}
//*******************************************************************************************
//*******************************************************************************************

int main(void){


	//--------------------------
	//Drivers.
	Sys_Init();
	Gpio_Init();
	SysTick_Init();
	__enable_irq();
	//***********************************************
	TIM1_InitForPWM();
	//TIM3_InitForPWM();//TIM3 генерирует ШИМ для трех каналов.
	TIM4_Init();      //TIM4 настривается для периодической генерации прерывания.

	//Заполнение таблицы сиинуса.
	FillSinTable();

	//__disable_irq();
	msDelay(500);
	//************************************************************************************
	while(1)
		{
			//msDelay(10);
			//***********************************************
			//Мигание светодиодами.
			Led_Blink();
			//***********************************************
			//Управление двигателем.
			//BLDC_Commutation();   //Управление ногодрыгом. - Работает!!!
			//BLDC_PWMCommutation();//Управление ногодрыгом + ШИМ - Работает!!!
			//msDelay(MOTOR_DELAY);

//			msDelay(5000);
//			TIM4->CR1 &= ~TIM_CR1_CEN;  //Counter disable
//
//			msDelay(4000);
//			volatile uint32_t ARRval = 800;
//			TIM4->ARR = (ARRval - 1);
//			TIM4->CR1 = TIM_CR1_CEN;  //Counter enable
			//***********************************************
			/* Sleep */
			//__WFI();
		}
	//************************************************************************************
}
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
void SysTick_Handler(void){

//	static uint16_t msCountForDS18B20 = 0;
//	//--------------------------
//	//Отсчет таймаута для датчика температуры.
//	if(++msCountForDS18B20 >= 1000)
//		{
//			msCountForDS18B20 = 0;
//			FlagsStr.DS18B20  = 1;
//		}
	//--------------------------
	msDelay_Loop();
	Blink_Loop();
	Encoder()->Loop();
}
//*******************************************************************************************
//*******************************************************************************************
#define PMSM_PWM 1500 //Коэфф-т заполнения от 0 до 1800



//Прерывание TIM4.
void TIM4_IRQHandler(void){

	uint16_t pwm1, pwm2, pwm3;
	//--------------------------
	TIM4->SR &= ~TIM_SR_UIF;//Сброс флага прерывания.
	//--------------------------
	//Генерация синуса
//	static uint16_t sinIndex = 0;
//
//	TIM1->CCR1 = sin_arr[sinIndex];
//
//	// Increment position in sine table
//	sinIndex++;
//	if(sinIndex > STEPS-1) sinIndex = 0;

	//--------------------------
	//BLDC_PWMCommutation();//Упраление ногодрыгом + ШИМ - Работает!!!

	//Установка скорости вращения производится изменением частоты срабатывания
	//таймера TIM4

	// Calculate PWM for 3-phase
//	pwm1 = (uint16_t)((uint32_t)(PMSM_PWM * PMSM_SINTABLE[sinTableIndex][0]) / 255);
//	pwm2 = (uint16_t)((uint32_t)(PMSM_PWM * PMSM_SINTABLE[sinTableIndex][1]) / 255);
//	pwm3 = (uint16_t)((uint32_t)(PMSM_PWM * PMSM_SINTABLE[sinTableIndex][2]) / 255);

//	//Set PWM
//	TIM1->CCR1 = pwm1;
//	TIM1->CCR2 = pwm2;
//	TIM1->CCR3 = pwm3;
//	// Increment position in sine table
//	sinTableIndex++;
//	if(sinTableIndex > PMSM_SINTABLESIZE-1) sinTableIndex = 0;
	//--------------------------

	//Расчет заполенеия ШИМ.
	pwm1 = (uint16_t)((uint32_t)(PMSM_PWM * sin_arr[sinTableIndex][0]) / STEPS_NUM);
	pwm2 = (uint16_t)((uint32_t)(PMSM_PWM * sin_arr[sinTableIndex][1]) / STEPS_NUM);
	pwm3 = (uint16_t)((uint32_t)(PMSM_PWM * sin_arr[sinTableIndex][2]) / STEPS_NUM);
	//Set PWM
	TIM1->CCR1 = pwm1;
	TIM1->CCR2 = pwm2;
	TIM1->CCR3 = pwm3;
	// Increment position in sine table
	sinTableIndex++;
	if(sinTableIndex > STEPS_NUM-1) sinTableIndex = 0;
}
//*******************************************************************************************
//*******************************************************************************************































