/*
 * iwdg_ST.c
 *
 *  Created on: 9 мар. 2023 г.
 *      Author: belyaev
 */
//*******************************************************************************************
//*******************************************************************************************

#include "iwdg_ST.h"

//*******************************************************************************************
//*******************************************************************************************


//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
// Function    : IWDG_Init()
// Description : Инициализация сторожевого таймера IWDG
// Parameters  : period - время, по прошествии которого сторожевой таймер
//				 перезагрузит микроконтроллер(от 7мс до 26200мс)
// RetVal      :
//*****************************************
void IWDG_Init(uint32_t period){

	/* Enable the peripheral clock RTC */
	RCC->CSR |= RCC_CSR_LSION;
	while((RCC->CSR & RCC_CSR_LSIRDY) != RCC_CSR_LSIRDY)
	{
		/* add time out here for a robust application */
	}

	IWDG->KR = IWDG_WRITE_ACCESS;	// Ключ для доступа к таймеру

	//Bits 2:0 PR[2:0]: Prescaler divider
	//These bits are write access protected seeSection 19.3.2. They are written by software to
	//select the prescaler divider feeding the counter clock. PVU bit of IWDG_SR must be reset in
	//order to be able to change the prescaler divider.
	//000: divider /4
	//001: divider /8
	//010: divider /16
	//011: divider /32
	//100: divider /64
	//101: divider /128
	//110: divider /256
	//111: divider /256
	IWDG->PR  = 7; 								//Для IWDG_PR=7 Tmin=6,4мс RLR=Tмс*40/256
	IWDG->RLR = (period * 40 + 256/2) / 256;	//Загрузить регистр перезагрузки
	IWDG->KR  = IWDG_REFRESH;					//Перезагрузка
	IWDG->KR  = IWDG_START; 					//Пуск таймера
}
//**********************************************************
// Function    : IWDG_Reset()
// Description : Сброс сторожевого таймера IWDG
// Parameters  :
// RetVal      :
//*****************************************
void IWDG_Reset(void){

	IWDG->KR = IWDG_REFRESH;
}
//**********************************************************
// Function    : IWDG_Stop()
// Description : Останов сторожевого таймера IWDG
// Parameters  :
// RetVal      :
//*****************************************
void IWDG_Stop(void){

	IWDG->KR  = IWDG_WRITE_ACCESS;	// Ключ для доступа к таймеру
	IWDG->RLR = 0;
	IWDG->KR  = IWDG_REFRESH;		// Перезагрузка
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************



















