/*
 * metadata.h
 *
 *  Created on: 28 мар. 2023 г.
 *      Author: belyaev
 */

#ifndef FOR_BOOTLOADER_METADATA_H_
#define FOR_BOOTLOADER_METADATA_H_
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************

#define APP_MAGIC 0xcafe

//************************************************************
typedef enum{
    APP_TYPE_LOADER 	= 0x1,
	APP_TYPE_APP 		= 0x2,
	APP_TYPE_UPDATER	= 0x3,
}app_type_t;
//************************************************************
//Структура метаданных приложения
typedef struct __attribute__((packed)){

	uint16_t 	metadataVersion;	//версия методанных

	//"магическое" число обычно представляет собой константу, которая используется
	//для идентификации формата файла или структуры данных.
	//В этом случае каждое изображение должно иметь байты 0xcafe в первых двух байтах.
	//Если число отличается - образ недействителен!
	uint16_t 	appMagic;			//"магическое" число

	uint8_t 	appType;			//???
	uint32_t 	appVectorAddr;		//стартовый адрес приложения
	uint32_t 	appSize;			//размер bin-файла приложения в байтах
	uint32_t 	appCrc;				//контрольная сумма bin-файла приложения
	uint8_t 	appVersion_major;	//
	uint8_t 	appVersion_minor;	//
	uint8_t 	appVersion_patch;	//
	char 		git_sha[8];			//хеш гита
	uint32_t 	reserved;			//
}appMetadata_t;
//*******************************************************************************************
//*******************************************************************************************


//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
#endif /* FOR_BOOTLOADER_METADATA_H_ */














