/*
 * 	main.c
 *
 *  Created on: 19 октября 2021 года.
 *  Autho     : Беляев А.А.
 *
 *	Описание        : I2C Boot Loader
 *  Датчики         :
 *  Вывод информации:
 *
 */
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
//Метаданные приложения.
//Некоторые матаданные прописываются константами в приложении. К таким константам относятся: версия методанных,
//"волшебное" число, тип приложения, и адрес векторной таблицы. Другие поля должны быть прочитаны из среды
//и введены, как DEFINES в наш Makefile.
//Некоторая информация в для метаданных может быть рассчитана только после того, как прошивка будет
//скомпилирована и слинкована. Например, длина двоичного файла, его CRC или его криптографическая подпись.
//Чтобы добавить его в шапку, мы должны отредактировать бинарник напрямую какой то внешней утилитой.

const appMetadata_t *const appMetadata = (appMetadata_t*)0x08002400;

applLaunch_t *applLaunch = (applLaunch_t*)0x20000000;

//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
int main(void){

	__disable_irq();
	//BOOT_DeinitAll();
	STM32_Clock_Init();
	GPIO_Init();
	DELAY_Init();
	BOOT_Init();
	__enable_irq();
	//***********************************************
	//Мигнем три раза - индикация запуска загрузчика.
	BOOT_Indication();

	//-------------------
	//TODO ... Во время работы приложения пришла команда на обновление прошивки
	//if(BOOT_GetAppLaunch() == APP_REWRITE_ME) goto BOOT;	//переход в загрузчик

	//-------------------
	//Проверка вершины стека приложения.
	if(!BOOT_AppAvailableCheck(APP_PROGRAM_START_ADDR)) goto BOOT;	//приложени отсутствует => переход в загрузчик

	//-------------------
	//TODO ... Подсчитаем сколько байт занимает приложение.
	if(appMetadata->appSize == 0) goto BOOT;		//0 - приложени отсутствует => переход в загрузчик

	//-------------------
	//TODO ... Проверим crc приложения. CRC лежит в метаданных приложения.
	//uint32_t crc = BOOT_CalcCrc((uint32_t*)APP_PROGRAM_START_ADDR ,appMetadata->appSize);
	//if(appMetadata->appCrc != crc) goto BOOT;

	//-------------------
	//Переходим в приложение в случае:
	//отстутствие запросов к загрузчику по шине I2C;
	//по истечении таймаута (1сек.).
	uint32_t micros = DELAY_microSecCount();
	while(BOOT_GetStateI2C() != I2C_IT_STATE_ADDR_WR)	//нет запросов от хоста по I2C
	{
		//Отсчет таймаута
		if((DELAY_microSecCount() - micros) >= (BOOT_I2C_TIMEOUT_MS*1000))
		{
			BOOT_GoToApp(APP_PROGRAM_START_ADDR);//Переход в приложение
			goto BOOT;							 //Если ошибка при переходе в приложение, то перходим в загрузчик.
		}
	}
	//***********************************************
	BOOT:
	IWDG_Init(3000); 	//Период сторожевого таймера 3 сек.
						//Сброс сторожевого таймера в ф-ии _waitEndRx() модуля bootLoader.c
	while(1)
	{
		BOOT_Loop(); 	//Загрузчик
	}
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
//void SysTick_IT_Handler(void){
//
//}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************






