/*
 * 	main.c
 *
 *  Created on: 19 октября 2021 года.
 *  Autho     : Беляев А.А.
 *
 *	Описание        :
 *  Датчики         :
 *  Вывод информации:
 *
 */
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
#define APP_START_ADDR	(FLASH_BASE + 6 * 1024)	//Адрес приложения


uint8_t buf[1024] = {0};
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
static void _initAll(void){

	STM32_Clock_Init();
	GPIO_Init();
	DELAY_Init();
//	SYS_TICK_Init();
//	I2C_Master_Init(I2C1, I2C_GPIO_NOREMAP, 400000);
}
//************************************************************

//************************************************************

//************************************************************
static void _goToApp(uint32_t appAddr){

	void(*goToApp)(void);
	//------------------
	appAddr = *(volatile uint32_t*)(appAddr + 4); //Адрес перехода из вектора Reset
	goToApp = (void(*)(void))appAddr;			  //Указатель на функцию перехода

	__disable_irq();						 //
	__set_MSP(*(volatile uint32_t*)appAddr); //Устанавливаем указатель стека SP приложения
	goToApp();								 //переход на приложение.
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
int main(void){

//	__disable_irq();
//	SCB->VTOR = 0x08002800;
	//***********************************************
	_initAll(); //Инициализация нужной периферии.

	DELAY_milliS(100);//Задержка для стабилизации напряжения питания.
	//***********************************************
	//Мигнем три раза - индикация запуска загрузчика.
	for(uint32_t i = 0; i < 3; i++)
	{
		LED_PC13_On();
		DELAY_milliS(250);
		LED_PC13_Off();
		DELAY_milliS(250);
	}
	DELAY_milliS(1000);

	//Тест1 - запись буфера в 1024 байта во шлэш. - Работает!!
	#define FLASH_BUF_SIZE	1024
	uint8_t flashBuf[FLASH_BUF_SIZE] = {0};

	for(uint32_t i=0; i < FLASH_BUF_SIZE; i++)//заполнение буфера числами от 0 до 1023
	{
		flashBuf[i] = i;
	}

	STM32_Flash_Unlock();
	STM32_Flash_ErasePage(FLASH_PAGE_127);
	STM32_Flash_WriteBuf(flashBuf, (uint32_t*)FLASH_PAGE_127, FLASH_BUF_SIZE);
	STM32_Flash_Lock();



//	flash = STM32_Flash_ReadWord(FLASH_PAGE_127);
//
//	STM32_Flash_ErasePage(FLASH_PAGE_127);
//
//	STM32_Flash_WriteWord(0x12345678, FLASH_PAGE_127);
//
//	flash = STM32_Flash_ReadWord(FLASH_PAGE_127);
//
//	STM32_Flash_WriteWord(0, FLASH_PAGE_127);
//
//	flash = STM32_Flash_ReadWord(FLASH_PAGE_127);
//
//	STM32_Flash_WriteWord(0xFFFFFFFF, FLASH_PAGE_127);
//
//	flash = STM32_Flash_ReadWord(FLASH_PAGE_127);


//	_goToApp(APP_START_ADDR);

//	SYS_TICK_Control(SYS_TICK_ON);
//	__enable_irq();
	//**************************************************************
	while(1)
	{
		LED_PC13_Toggel();
		DELAY_milliS(50);
		//__WFI();//Sleep
	}
	//**************************************************************
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
void SysTick_IT_Handler(void){

}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************






