/*
 * 	main.c
 *
 *  Created on: 19 октября 2021 года.
 *  Autho     : Беляев А.А.
 *
 *	Описание        : I2C Boot Loader
 *  Датчики         :
 *  Вывод информации:
 *
 */
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************


//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
// Function      SetAppState()
// Description   Sets bootloader key
// Parameters    None
// RetVal        None
//*****************************************
void SetAppState(uint32_t state){

	STM32_Flash_Unlock();
	STM32_Flash_WriteWord(state, APP_CONDITION_ADDR);
	STM32_Flash_Lock();
}
//*******************************************************************************************
// Function      ResetKey()
// Description   Resets bootloader key
// Parameters    None
// RetVal        None
//*****************************************
void ResetAppState(){

	STM32_Flash_Unlock();
	STM32_Flash_ErasePage(APP_CONDITION_ADDR);
	STM32_Flash_Lock();
}
//*******************************************************************************************
// Function      GetAppState()
// Description   Reads bootloader key value
// Parameters    None
// RetVal        None
//*****************************************
uint32_t GetAppState(){

  return STM32_Flash_ReadWord(APP_CONDITION_ADDR);
}
//*******************************************************************************************
// Function   : AppAvailableCheck()
// Description: по стартовому адресу приложения должно лежать значение вершины стека
//			    приложения, т.е. значение больше 0x2000 0000. Если это не так, значит
//				приложение отсутсвует
// Parameters : Нет
// RetVal     : 1 - приложение есть; 0 - приложения нет.
//*****************************************
//static uint32_t AppAvailableCheck(void){
//
//	if((STM32_Flash_ReadWord(APP_PROGRAM_START_ADDR) & 0x2FFC0000) != 0x20000000) return 0;
//	return 1;
//}
//*******************************************************************************************
// Function      GoToApp
// Description
// Parameters
// RetVal
//*****************************************
//static void GoToApp(uint32_t appAddr){
//
//	void(*goToApp)(void);
//	uint32_t addrResetHandler;
//	//------------------
//	//Дополнительная проверка:
//	//по стартовому адресу приложения должно лежать значение вершины стека приложения
//	//т.е. значение больше 0x2000 0000
//	if(!AppAvailableCheck()) return;
//
//	__disable_irq();
//	__set_MSP(*(volatile uint32_t*)appAddr);               	//Устанавливаем указатель стека SP приложения
//	addrResetHandler = *(volatile uint32_t*)(appAddr + 4); 	//Адрес функции Reset_Handler приложения
//	goToApp = (void(*)(void))addrResetHandler; 			  	//Указатель на функцию Reset_Handler приложения
//	goToApp();								   				//Переход на функцию Reset_Handler приложения
//}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************

//static uint8_t flashBuf[64] = {0};

int main(void){

	__disable_irq();
	STM32_Clock_Init();
	GPIO_Init();
	DELAY_Init();
	//***********************************************
	//Мигнем три раза - индикация запуска загрузчика.
	for(uint32_t i = 0; i < 3; i++)
	{
		DELAY_milliS(100);
		LED_PC13_On();
		DELAY_milliS(100);
		LED_PC13_Off();
	}
//	DELAY_milliS(1000);
	//***********************************************
	BOOT_LOADER_I2CInit(); //Инициализация I2C Slave для работы по прерываниям.

//	STM32_Flash_ReadBufU32((void*)APP_PROGRAM_START_ADDR, (void*)flashBuf, 6);
//	STM32_Flash_ReadBufU8 ((void*)APP_PROGRAM_START_ADDR, (void*)&flashBuf[10], 6);
//
//	flashBuf[20] = *(__IO uint8_t*)(APP_PROGRAM_START_ADDR+0);
//	flashBuf[21] = *(__IO uint8_t*)(APP_PROGRAM_START_ADDR+1);
//	flashBuf[22] = *(__IO uint8_t*)(APP_PROGRAM_START_ADDR+2);
//	flashBuf[23] = *(__IO uint8_t*)(APP_PROGRAM_START_ADDR+3);

	__enable_irq();
	//***********************************************
	while(1)
	{
		BOOT_LOADER_Loop();
	}
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
void SysTick_IT_Handler(void){

}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************






