/*
 * 	main.c
 *
 *  Created on: 19 октября 2021 года.
 *  Autho     : Беляев А.А.
 *
 *	Описание        : I2C Boot Loader
 *  Датчики         :
 *  Вывод информации:
 *
 */
//*******************************************************************************************
//*******************************************************************************************

#include "main.h"

//*******************************************************************************************
//*******************************************************************************************
//Параметры загрузчика:
//Интерфейс        			: I2C (I2C1 или I2C зависит от устройства)
//Скорость        			: 400кГц (возможно лучше 100кГц для лучшей надежности)
//Переход в режим загрузчика: при старте МК первым запускается З
//Начальный адрес  			: 0х0800 0000
//Размер	         		: 10КБ(10240 байт = 0х2800)
//							  из них 9КБ - это сам загрузчик,
//      						     1КБ - это обасть хранения состояния приложения.

#define BOOT_SIZE				(9 * 1024) 					//размер загрузчика, в байтах
#define APP_CONDITION_SIZE		(1 * 1024) 					//размер области хранения условий запуска основного приложения, в байтах
#define APP_CONDITION_ADDR  	(FLASH_BASE + BOOT_SIZE) 	//адрес обасти хранения состояния приложения

//Состояния основного приложения
#define APP_NO					0xFFFFFFFF	//приложение отсутствует
#define APP_OK_AND_START 		0xAAAA0001	//CRC в норме, можно запускать
#define APP_REWRITE_ME			0xAAAA0002	//была команда на переход в загрузчик после ресета
#define APP_CRC_ERR 			0xAAAA001F	//ошибка CRC

//Праметры приложения:
//Начальный адрес: 0х0800 0000 + 0х2800 = 0х0800 2800
//Размер         : размер_флеш_памяти_МК - размер_загрузчика
//Условие перехода из загрузчика в приложение: таймаут (1 сек.)
//                                             по команде (команда Go загрузчика)
#define APP_PROGRAM_START_ADDR	(FLASH_BASE + BOOT_SIZE + APP_CONDITION_SIZE)  //начальный адрес приложения
//**********************************


//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
// Function      SetAppState()
// Description   Sets bootloader key
// Parameters    None
// RetVal        None
//*****************************************
void SetAppState(uint32_t state){

	STM32_Flash_Unlock();
	STM32_Flash_WriteWord(state, APP_CONDITION_ADDR);
	STM32_Flash_Lock();
}
//*******************************************************************************************
// Function      ResetKey()
// Description   Resets bootloader key
// Parameters    None
// RetVal        None
//*****************************************
void ResetAppState(){

	STM32_Flash_Unlock();
	STM32_Flash_ErasePage(APP_CONDITION_ADDR);
	STM32_Flash_Lock();
}
//*******************************************************************************************
// Function      GetAppState()
// Description   Reads bootloader key value
// Parameters    None
// RetVal        None
//*****************************************
uint32_t GetAppState(){

  return STM32_Flash_ReadWord(APP_CONDITION_ADDR);
}
//*******************************************************************************************
// Function   : AppAvailableCheck()
// Description: по стартовому адресу приложения должно лежать значение вершины стека
//			    приложения, т.е. значение больше 0x2000 0000. Если это не так, значит
//				приложение отсутсвует
// Parameters : Нет
// RetVal     : 1 - приложение есть; 0 - приложения нет.
//*****************************************
static uint32_t AppAvailableCheck(void){

	if((STM32_Flash_ReadWord(APP_PROGRAM_START_ADDR) & 0x2FFC0000) != 0x20000000) return 0;
	return 1;
}
//*******************************************************************************************
// Function      GoToApp
// Description
// Parameters
// RetVal
//*****************************************
//static void GoToApp(uint32_t appAddr){
//
//	void(*goToApp)(void);
//	uint32_t addrResetHandler;
//	//------------------
//	//Дополнительная проверка:
//	//по стартовому адресу приложения должно лежать значение вершины стека приложения
//	//т.е. значение больше 0x2000 0000
//	if(!AppAvailableCheck()) return;
//
//	__disable_irq();
//	__set_MSP(*(volatile uint32_t*)appAddr);               	//Устанавливаем указатель стека SP приложения
//	addrResetHandler = *(volatile uint32_t*)(appAddr + 4); 	//Адрес функции Reset_Handler приложения
//	goToApp = (void(*)(void))addrResetHandler; 			  	//Указатель на функцию Reset_Handler приложения
//	goToApp();								   				//Переход на функцию Reset_Handler приложения
//}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
int main(void){

	__disable_irq();
	STM32_Clock_Init();
	GPIO_Init();
	DELAY_Init();
	//***********************************************
	//Мигнем три раза - индикация запуска загрузчика.
	for(uint32_t i = 0; i < 3; i++)
	{
		DELAY_milliS(100);
		LED_PC13_On();
		DELAY_milliS(100);
		LED_PC13_Off();
	}
//	DELAY_milliS(1000);
	//***********************************************
	BOOT_LOADER_I2CInit(); //Инициализация I2C Slave для работы по прерываниям.

	//Прерывания I2C для работы протакола - приоритет = 2
//	NVIC_SetPriority(I2C1_EV_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 2, 0));
//	NVIC_SetPriority(I2C1_ER_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 2, 0));
//	__enable_irq();
	//***********************************************
	while(1)
	{
		BOOT_LOADER_Loop();
		//DELAY_milliS(10);
	}
}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//Прерывание каждую милисекунду.
void SysTick_IT_Handler(void){

}
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************
//*******************************************************************************************






